Internet Draft                                         Lou Berger (LabN)
Category: Standards Track                             Don Fedyk (Nortel)
Expiration Date: February 8, 2009

                                                          August 8, 2008

       Generalized MPLS (GMPLS) Support For Metro Ethernet Forum
                and G.8011 User-Network Interface (UNI)

                 draft-ietf-ccamp-gmpls-mef-uni-01.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/1id-abstracts.html

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html

   This Internet-Draft will expire on February 8, 2009.

Copyright Notice

   Copyright (C) The IETF Trust (2008).

Abstract

   This document describes a method for controlling two specific types
   of Ethernet switching via a Generalized Multi-Protocol Label
   Switching (GMPLS) based User-Network Interface (UNI).  This document
   supports the types of switching required to implied by the Ethernet
   services that have been defined in the context of the Metro Ethernet
   Forum (MEF) and International Telecommunication Union (ITU) G.8011.
   This document is the UNI companion to "Generalized MPLS (GMPLS)
   Support For Metro Ethernet Forum and G.8011 Ethernet Service
   Switching".  This document does not define or limit the underlying
   intra-domain or Internal NNI (I-NNI) technology used to support the
   UNI.




Berger & Fedyk               Standards Track                    [Page 1]

Internet-Draft    draft-ietf-ccamp-gmpls-mef-uni-01.txt    August 8, 2008


Table of Contents

 1      Introduction  ..............................................   3
 1.1    Overview  ..................................................   4
 1.2    Conventions used in this document  .........................   5
 2      Common Signaling Support  ..................................   5
 2.1    UNI Addressing  ............................................   5
 2.2    Ethernet Endpoint (UNI) Identification  ....................   6
 2.2.1  Address Resolution  ........................................   6
 2.3    Connection Identification  .................................   7
 3      EPL Service  ...............................................   7
 4      EVPL Service  ..............................................   7
 4.1    Egress VLAN ID Control and VLAN ID preservation  ...........   7
 5      IANA Considerations  .......................................   8
 5.1    Error Value: Routing Problem/Unknown Endpoint  .............   8
 6      Security Considerations  ...................................   8
 7      References  ................................................   8
 7.1    Normative References  ......................................   8
 7.2    Informative References  ....................................   9
 8      Acknowledgments  ...........................................  10
 9      Author's Addresses  ........................................  10
10      Full Copyright Statement  ..................................  10
11      Intellectual Property  .....................................  11





















Berger & Fedyk               Standards Track                    [Page 2]

Internet-Draft    draft-ietf-ccamp-gmpls-mef-uni-01.txt    August 8, 2008


1. Introduction

   [MEF6] and [G.8011] provide parallel frameworks for defining network-
   oriented characteristics of Ethernet services in transport networks.
   The framework discusses general Ethernet connection characteristics,
   Ethernet User-Network Interfaces (UNIs) and Ethernet Network-Network
   Interfaces (NNIs). Within this framework, [G.8011.1] defines the
   Ethernet Private Line (EPL) service and [G.8011.2] defines the
   Ethernet Virtual Private Line (EVPL) service. [MEF6] covers both
   service types.  [MEF10.1] defines service parameters and [MEF11]
   provides UNI requirements and framework.

   This document provides a method for GMPLS based control of LSPs that
   support the transport services defined in the above documents at the
   UNI network reference points.  This document does not define or limit
   the underlying intra-domain or Internal NNI (I-NNI) technology used
   to support the UNI.  This document makes use of the GMPLS extensions
   defined in [GMPLS-ESVCS] and [GMPLS-EXT].

   The scope of this document covers Ethernet UNI applications, and it
   is intended to be consistent with the GMPLS overlay model presented
   in [RFC4208] and aligned with GMPLS Core Network signaling.  The
   scope and reference model used in this document are represented in
   Figure 1, which is based on Figure 1 of [RFC4208].

   Figure 1 shows two core networks, each containing two core-nodes.
   The core-nodes are labeled 'CN'.  Connected to each CN is an edge-
   node.  The edge-nodes are labeled 'EN'.  Each EN supports Ethernet
   Networks and use Ethernet services provided by the core-nodes via a
   UNI.  Two services are represented; one EPL and one EVPL type
   service.  Signaling within the core network is out of scope of this
   document and may include any technology that supports overlay UNI
   services.  The UNI function in the edge-node can be referred to as
   the UNI client, or UNI-C, and in the CN as UNI network, or UNI-N.

















Berger & Fedyk               Standards Track                    [Page 3]

Internet-Draft    draft-ietf-ccamp-gmpls-mef-uni-01.txt    August 8, 2008


        Ethernet                                          Ethernet
        Network   UNI +----------+    +-----------+ UNI   Network
      +---------+     |          |    |           |     +---------+
      |  +----+ |     |  +-----+ |    |  +-----+  |     | +----+  |
   ------+    | | EPL |  |     | |    |  |     |  | EPL | |    +------
   ------+ EN +-+-----+--+ CN  +---------+  CN +--+-----+-+ EN +------
      |  |    | |  +--+--|     +---+  |  |     +--+-----+-+    |  |
      |  +----+ |  |  |  +--+--+ | |  |  +--+--+  |     | +----+  |
      |         |  |  |     |    | |  |     |     |     |         |
      +---------+  |  |     |    | |  |     |     |     +---------+
                   |  |     |    | |  |     |     |
      +---------+  |  |     |    | |  |     |     |     +---------+
      |         |  |  |  +--+--+ | |  |  +--+--+  |     |         |
      |  +----+ |  |  |  |     | | +-----+     |  |     | +----+  |
   ------+    +-+--+  |  | CN  +---------+ CN  |  |     | |    +------
   ------+ EN +-+-----+--+     | |    |  |     +--+-----+-+ EN +------
      |  |    | |EVPL |  +-----+ |    |  +-----+  |EVPL | |    |  |
      |  +----+ |     |          |    |           |     | +----+  |
      |         |     +----------+    |-----------+     |         |
      +---------+            Core Network(s)            +---------+
        Ethernet                                          Ethernet
        Network <----->                           <-----> Network
                          Scope of this Document

                        Legend:   EN  -  Edge Node
                                  CN  -  Core Node

                  Figure 1: Ethernet UNI Reference Model


1.1. Overview

   This document uses a common approach to supporting the switching
   implied by the Ethernet services defined in [MEF6], [G.8011.1] and
   [G.8011.2].  The approach builds on standard GMPLS mechanisms to
   deliver the required control capabilities. This document reuses the
   GMPLS mechanisms specified in [GMPLS-ESVCS], [RFC4208], and
   [RFC4974].

   Support for P2P and MP2MP service is required by [G.8011] and
   [MEF11].  P2P service delivery support is based on the GMPLS support
   for Ethernet Services covered in [GMPLS-ESVCS].  As with [GMPLS-
   ESVCS], the definition of support for MP2MP service is left for
   future study and is not addressed in this document.

   [MEF11] defines multiple types of control for UNI Ethernet services.
   In MEF UNI Type 1, services are configured manually.  In MEF UNI Type
   2, services may be configured manually or via a link management



Berger & Fedyk               Standards Track                    [Page 4]

Internet-Draft    draft-ietf-ccamp-gmpls-mef-uni-01.txt    August 8, 2008


   interface.  In MEF UNI Type 3, services may be established and
   managed via a signaling interface.  As with [GMPLS-ESVCS] this
   document is aimed at supporting the MEF UNI Type 3 mode of operation
   (and not MEF UNI Types 1 and 2).  As mentioned above, this document
   is limited to covering UNI specific topics.

   Common procedures used to signal Ethernet connections are described
   in Section 2 of this document.  Procedures related to signaling
   switching in support of EPL services are described in Section 3.
   Procedures related to signaling switching in support of EVPL services
   are described in Section 4.


1.2. Conventions used in this document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].


2. Common Signaling Support

   This section describes the common mechanisms for supporting a UNI
   reference point for LSPs that provide the Ethernet Services described
   in [GMPLS-ESVCS].

   Except as specifically modified in this document, the procedures
   related to the processing of RSVP objects is not modified by this
   document.  The relevant procedures in existing documents, notably
   [GMPLS-ESVCS], [GMPLS-EXT] and [RFC4208], MUST be followed in all
   cases not explicitly described in this document.


2.1. UNI Addressing

   LSPs providing Ethernet connections controlled via the mechanisms
   defined in this document MUST use the addressing and other procedures
   defined in [RFC4208].  Of note, this includes the use of the egress
   edge-node's IP address in the end-point address field in the SESSION
   object.

   One issue that presents itself with the addressing approach taken in
   [RFC4208] is that an ingress edge-node may not receive the egress
   edge-node's IP address as part of the management, or other, request
   that results in the initiation of a new Ethernet connection.  This
   case is covered as described in Section 7.2 of [RFC4974] and modified
   below in Section 2.2.1.




Berger & Fedyk               Standards Track                    [Page 5]

Internet-Draft    draft-ietf-ccamp-gmpls-mef-uni-01.txt    August 8, 2008


2.2. Ethernet Endpoint (UNI) Identification

   UNI identification, except as noted below, MUST follow Ethernet
   endpoint (UNI) identification as defined in [GMPLS-ESVCS]. There is
   one additional case that is covered in this document where the scope
   of the Ethernet endpoint identifier is relevant beyond the typical
   case of just ingress and egress nodes.


2.2.1. Address Resolution

   At the UNI reference point, it is possible for the ingress edge-node
   to not have the egress edge-node's IP address when initiating an LSP.
   This presents an issue as the egress edge-node's IP address is
   carried in the SESSION object.  This case is handled leveraging the
   approach described in Section 7.2 of [RFC4974] to address call ID
   assignment by the first core-node.

   When an edge-node (the UNI-C) initiates an LSP and it has the egress
   Ethernet endpoint identifier, but does not have its IP address, the
   edge-node MUST create a Notify message as described in [RFC4974].
   The Notify message MUST include the CALL_ATTRIBUTES object with the
   Endpoint ID TLV defined [GMPLS-ESVCS]. The tunnel end point address
   field of the SESSION object in the Notify message MUST be set to zero
   (0).  The message MUST be addressed and sent to an address associated
   with the first core-node.

   When a core-node, i.e., the node providing the network side of the
   UNI (the UNI-N), receives a Notify message with the tunnel end point
   address field of the SESSION object set to zero, it MUST locate the
   Endpoint ID TLV in the CALL_ATTRIBUTES object.  If the object or TLV
   are not present, the node MUST discard the message.  In this case, a
   Message ID Acknowledgment MUST NOT be sent for the Notify message.

   When the Endpoint ID TLV is located, the node MUST map the Endpoint
   ID into an IP address associated with the egress edge-node.  If the
   node is unable to obtain an egress address, it MUST issue an error
   response Notify messages according to Section 6.2.2. of [RFC4974].
   The Error code and value SHOULD be "Routing Problem/Unknown
   Endpoint." (To be assigned by IANA).

   When the node is able to obtain an egress address, the end-point
   address field of the SESSION object MUST be set to the obtained
   address, and the Notify message should be sent according to the
   standard processing defined in [RFC4974].  The downstream nodes will
   then process the Notify according to standard processing rules.

   When the ingress receives the response Notify message, it SHOULD



Berger & Fedyk               Standards Track                    [Page 6]

Internet-Draft    draft-ietf-ccamp-gmpls-mef-uni-01.txt    August 8, 2008


   identify the call based on the Endpoint ID TLV and, when not set to
   zero on the corresponding setup Notify message, the short and long
   Call IDs. The end-point address field of the SESSION object carried
   in the response Notify message will include the egress' IP address.
   This returned address MUST be used in all subsequent messages
   associated with the Ethernet connection.

   Note that the procedure described in this section MAY be used when
   the Call IDs are generated by the initiating UNI or generated by the
   first core-node.


2.3. Connection Identification

   With one exception, UNI signaling for Ethernet connections MUST
   follow the Connection Identification procedures defined in [GMPLS-
   ESVCS].  The exception is that the procedures defined in Section 7.2
   of [RFC4974] MAY be used to provide support for allocation of Call
   IDs by the first core-node rather than by the initiating edge-node.


3. EPL Service

   There are no additional UNI specific requirements for signaling LSPs
   supporting Ethernet Private Line (EPL) services. The procedures
   defined in [GMPLS-ESVCS], as modified above, MUST be followed when
   signaling an LSPs supporting an EPL Service.


4. EVPL Service

   There is one additional UNI specific requirements for signaling LSPs
   supporting an EVPL type service.  Except as modified above and by
   this section, the procedures defined in [GMPLS-ESVCS] MUST be
   followed when signaling an EVPL Service.


4.1. Egress VLAN ID Control and VLAN ID preservation

   Per [MEF6], the mapping of the single VLAN ID used at the ingress UNI
   to a different VLAN ID at the egress UNI is allowed for EVPL services
   that do not support both bundling and VLAN ID preservation.  Such a
   mapping MUST be requested and signaled based on the explicit label
   control mechanism defined in [RFC4208], and not the mechanism define
   in [GMPLS-ESVCS].

   As is the case in [GMPLS-ESVCS], when the explicit label control
   mechanism is not used VLAN IDs MUST be preserved, i.e., not modified,



Berger & Fedyk               Standards Track                    [Page 7]

Internet-Draft    draft-ietf-ccamp-gmpls-mef-uni-01.txt    August 8, 2008


   across the LSP.


5. IANA Considerations

   IANA is requested to administer assignment of new values for
   namespaces defined in this document and reviewed in this section.


5.1. Error Value: Routing Problem/Unknown Endpoint

   Upon approval of this document, the IANA will make the assignment in
   the "Error Codes and Globally-Defined Error Value Sub-Codes" section
   of the "RSVP PARAMETERS" registry located at
   http://www.iana.org/assignments/rsvp-parameters:

   Error Code      Meaning
     24  Routing Problem                             [RFC3209]

         This Error Code has the following globally-defined Error
         Value sub-codes:

         28* =  Unknown Endpoint                     [This document]

   (*) Suggested value.


6. Security Considerations

   This document introduces new message object formats for use in GMPLS
   signaling [RFC3473].  It does not introduce any new signaling
   messages, nor change the relationship between LSRs that are adjacent
   in the control plane. As such, this document introduces no additional
   security considerations.  See [RFC3473] for relevant security
   considerations.


7. References

7.1. Normative References

   [GMPLS-ESVCS] Berger, L., Papadimitriou, P., Fedyk, D.,
                 "Generalized MPLS (GMPLS) Support For Metro Ethernet
                 Forum and G.8011 Ethernet Service Switching", Work in
                 Progress, draft-ietf-ccamp-gmpls-ether-svcs-02.txt,
                 August 2008.





Berger & Fedyk               Standards Track                    [Page 8]

Internet-Draft    draft-ietf-ccamp-gmpls-mef-uni-01.txt    August 8, 2008


   [GMPLS-EXT]  Berger, L., Papadimitriou, P., Fedyk, D.,
                "Generalized MPLS (GMPLS) Data Channel Switching
                Capable (DCSC) and Channel Set Label Extensions",
                draft-ietf-ccamp-gmpls-dcsc-channel-ext-00.txt,
                Work in Progress, August 2008.

   [RFC2119] Bradner, S., "Key words for use in RFCs to Indicate
             Requirement Levels," RFC 2119.

   [RFC3209] Awduche, D., Berger, L., Gan, D., Li, T.,
             Srinivasan, V. and G. Swallow, "RSVP-TE: Extensions
             to RSVP for LSP Tunnels", RFC 3209, December 2001.

   [RFC3473] Berger, L., Editor, "Generalized Multi-Protocol Label
             Switching (GMPLS) Signaling - Resource ReserVation
             Protocol-Traffic Engineering (RSVP-TE) Extensions",
             RFC 3473, January 2003.

   [RFC4208] Swallow, G., et al. "Generalized Multiprotocol Label
             Switching (GMPLS) User-Network Interface (UNI): Resource
             ReserVation Protocol-Traffic Engineering
             (RSVP-TE) Support for the Overlay  Model", RFC 4208,
             October 2005.

   [RFC4974] Papadimitriou, D., Farrel, A. "Generalized MPLS
             (GMPLS) RSVP-TE Signaling Extensions in support of Calls",
             RFC 4974, August 2007.


7.2. Informative References

   [G.8011]         ITU-T G.8011/Y.1307, "Ethernet over Transport
                    Ethernet services framework", August 2004.

   [G.8011.1]       ITU-T G.G.8011.1/Y.1307.1, "Ethernet private
                    line service", August 2004.

   [G.8011.2]       ITU-T G.8011.2/Y.1307.2, "Ethernet virtual
                    private line service", September 2005.

   [MEF6]           The Metro Ethernet Forum, "Ethernet Services
                    Definitions - Phase I", MEF 6, June 2004

   [MEF10.1]        The Metro Ethernet Forum, "Ethernet Services
                    Attributes Phase 2", MEF 10.1, November 2006.






Berger & Fedyk               Standards Track                    [Page 9]

Internet-Draft    draft-ietf-ccamp-gmpls-mef-uni-01.txt    August 8, 2008


   [MEF11]          The Metro Ethernet Forum , "User Network
                    Interface (UNI) Requirements and Framework",
                    MEF 11, November 2004.


8. Acknowledgments

   Dimitri Papadimitriou provided substantial textual contributions to
   this document and coauthored earlier versions of this document.

   The authors would like to thank Evelyne Roch and Stephen Shew for
   their valuable comments.


9. Author's Addresses

   Lou Berger
   LabN Consulting, L.L.C.
   Phone: +1-301-468-9228
   Email: lberger@labn.net

   Don Fedyk
   Nortel Networks
   600 Technology Park Drive
   Billerica, MA, 01821
   Phone: +1-978-288-3041
   Email: dwfedyk@nortel.com

10. Full Copyright Statement

   Copyright (C) The IETF Trust (2008).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.








Berger & Fedyk               Standards Track                   [Page 10]

Internet-Draft    draft-ietf-ccamp-gmpls-mef-uni-01.txt    August 8, 2008


11. Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed
   to pertain to the implementation or use of the technology
   described in this document or the extent to which any license
   under such rights might or might not be available; nor does it
   represent that it has made any independent effort to identify any
   such rights.  Information on the procedures with respect to rights
   in RFC documents can be found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use
   of such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository
   at http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention
   any copyrights, patents or patent applications, or other
   proprietary rights that may cover technology that may be required
   to implement this standard.  Please address the information to the
   IETF at ietf-ipr@ietf.org.

Acknowledgement

   Funding for the RFC Editor function is provided by the IETF
   Administrative Support Activity (IASA).























Berger & Fedyk               Standards Track                   [Page 11]

Generated on: Fri Aug 8 10:17:27 EDT 2008
